#include <iostream>

int main(){
    // 変数を宣言する
    // 入力される点数を保持する変数と出力する値を保持する変数
    int /* 入力変数名 */, /* 出力変数名 */;
    
    // 入力する
    std::cin >> /* 入力変数名 */;
    
    // 処理を行う
    if(/* 初級の場合 */){
        // 初級の場合の出力を求める
        /* 出力変数名 */ = /* 計算式 */;
    }
    else if(/* 中級の場合 */){
        // 中級の場合の出力を求める
        /* 出力変数名 */ = /* 計算式 */;
    }
    else if(/* 上級の場合 */){
        // 上級の場合の出力を求める
        /* 出力変数名 */ = /* 計算式 */;
    }

    // 結果を出力する
    if(/* 初級,中級,上級の場合 */){
        /* 計算したものを出力する */
    }
    else{
        /* 文字列を出力する */
    }
}
